import time
# 最后一节课后必须增加一节课，列表长度需保持相等
Mon = ["地理","化学","语文","英语","数学","物理","政治","体育","班会","自修",'自修']
Tue = ["语文","地理","历史","物理","英语","数学","语文","心理","自修","体活",'自修']
Wed = ["物理","数学","化学","语文","地理","信息","音乐","英语","生物","体活",'自修']
Thu = ["英语","物理","体育","数学","化学","地理","数学","语文","政治","自修",'自修']
Fri = ["数学","语文","英语","信息","物理","化学","英语","历史","生物","体活",'自修'] 
Sat = ["语文","地理","物理","数学","数学","化学","英语","无","无","无","无"]
Sun = ["无","无","无","无","无","无","无","无","无","无","无"] 
dataList = [Mon,Tue,Wed,Thu,Fri,Sat,Sun]
pp1 = [27000, 29400, 30000, 32400, 33900, 36300, 36900, 39300, 39600, 42000,48600]
pp2 = [48600, 51000, 51600, 54000, 54900, 57300, 57900, 60300, 60300, 62400,86399]
pp3 = [27900, 30300, 30900, 33300, 33900, 36300, 36900, 39300, 39600, 42000,48600]
def write1(day):
    lis = dataList[day]
    return lis
def write2(n):
    if n == 1:
        return pp1
    elif n == 2:
        return pp2
    elif n == 3:
        return pp3

if __name__=="__main__":
    print(write1(1))